import os
while True:
    print("|-------------------------无敌开服器V1.0-------------------------|")
    print("|----------------------------1.开服-----------------------------|")
    print("|----------------------------2.修改服务器设置--------------------|")
    print("|----------------------------3.创建服务器-----------------------|")
    print("|----------------------------4.退出----------------------------|")
    print("|______________________________________________________________|")
    num = input("请输入服务：")
    if num == "1":
        if os.system(r"create\create.py") != 0:
            print("检测到非正常退出")
    elif num == "2":
        if os.system(r"edit\edit.py") != 0:
            print("检测到非正常退出")
    elif num == "3":
        if os.system(r"create\create2.py") != 0:
            print("检测到非正常退出")
    elif num == "4":
        break